# 0. Imports

In [1]:
import pandas as pd
import numpy as np
import plotly.express as px

# 1. Load Dataframe

In [2]:
data = pd.read_csv('datasets/kc_house_data.csv')

In [3]:
data.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [4]:
data.shape

(21613, 21)

In [5]:
data.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [6]:
data.dtypes

id                 int64
date              object
price            float64
bedrooms           int64
bathrooms        float64
sqft_living        int64
sqft_lot           int64
floors           float64
waterfront         int64
view               int64
condition          int64
grade              int64
sqft_above         int64
sqft_basement      int64
yr_built           int64
yr_renovated       int64
zipcode            int64
lat              float64
long             float64
sqft_living15      int64
sqft_lot15         int64
dtype: object

In [7]:
# Converitng data from object to date
data['date'] = pd.to_datetime(data['date'])

# 2. Filters

In [39]:
price_limit = data['price'].mean()
bedrooms_values = data['bedrooms'].unique()

In [45]:
bedrooms_values

array([ 3,  2,  4,  5,  1,  6,  7,  0,  8,  9, 11, 10, 33])

In [40]:
type(bedrooms_values)

numpy.ndarray

In [51]:
bedrooms_filter = [0, 3, 1]

In [52]:
bedrooms_values[bedrooms_filter]

array([3, 5, 2])

In [53]:
bedrooms_values[bedrooms_filter].tolist()

[3, 5, 2]

In [54]:
data[data['bedrooms'].isin(bedrooms_values[bedrooms_filter].tolist())][['id','bedrooms']]

               id  bedrooms
0      7129300520         3
1      6414100192         3
2      5631500400         2
4      1954400510         3
6      1321400060         3
...           ...       ...
21607  2997800021         3
21608   263000018         3
21610  1523300141         2
21611   291310100         3
21612  1523300157         2

[14185 rows x 2 columns]

In [55]:
data[(data['price'] <= price_limit) & (data['bedrooms'].isin(bedrooms_values[bedrooms_filter].tolist()))][['id', 'lat', 'long', 'price', 'bedrooms']]

               id      lat     long     price  bedrooms
0      7129300520  47.5112 -122.257  221900.0         3
1      6414100192  47.7210 -122.319  538000.0         3
2      5631500400  47.7379 -122.233  180000.0         2
4      1954400510  47.6168 -122.045  510000.0         3
6      1321400060  47.3097 -122.327  257500.0         3
...           ...      ...      ...       ...       ...
21607  2997800021  47.5773 -122.409  475000.0         3
21608   263000018  47.6993 -122.346  360000.0         3
21610  1523300141  47.5944 -122.299  402101.0         2
21611   291310100  47.5345 -122.069  400000.0         3
21612  1523300157  47.5941 -122.299  325000.0         2

[10009 rows x 5 columns]